Autodesk.Revit.DB.OrdinateTextPosition.NextToWitnessLine
the dimension text position next to witness line

Autodesk.Revit.DB.OrdinateTextPosition.EndOfWitnessLine
the dimension text position at the end of witness line